In [1]:
#import my library
import pandas as pd

In [2]:
dict1 = {'Name':['Priyang','Aadhaya','Krisha','Vedant','Parshv','Miktal','Archana'],'Marks':[98,89,99,97,90,93,89],
         'Gender':['Male','Female','Female','Male','Male','Female','Female']}

df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1  Aadhaya     89  Female
2   Krisha     99  Female
3   Vedant     97    Male
4   Parshv     90    Male
5   Miktal     93  Female
6  Archana     89  Female

### 1. Display Top 3 Rows of the Dataset

In [3]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1  Aadhaya     89  Female
2   Krisha     99  Female

### 2. Display Last 3 Rows of the Dataset

In [4]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Miktal     93  Female
6  Archana     89  Female

### 3. Find the shape of our Dataset (Number of Rows and Columns)

In [5]:
df1.shape

(7, 3)

In [6]:
type(df1.shape)

tuple

In [7]:
print('Number of Rows',df1.shape[0])
print('Number of Columns',df1.shape[1])

Number of Rows 7
Number of Columns 3

### 4. Get information about our Dataset

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

### 5. Check for Null Values in the Dataset

In [9]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [10]:
df1.isnull().sum() # shows no missing values in our Dataset sum(0) columns sum(1) rows

Name      0
Marks     0
Gender    0
dtype: int64

### 6. Get overall statistics of the Dataframe

In [11]:
df1.describe()

           Marks
count   7.000000
mean   93.571429
std     4.391550
min    89.000000
25%    89.500000
50%    93.000000
75%    97.500000
max    99.000000

In [12]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  93.571429     NaN
std         NaN   4.391550     NaN
min         NaN  89.000000     NaN
25%         NaN  89.500000     NaN
50%         NaN  93.000000     NaN
75%         NaN  97.500000     NaN
max         NaN  99.000000     NaN

### 7. Find Onique Values From the Gender Column

In [13]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1  Aadhaya     89  Female
2   Krisha     99  Female
3   Vedant     97    Male
4   Parshv     90    Male
5   Miktal     93  Female
6  Archana     89  Female

In [14]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

### 8. Find the number of Unque Values from the gender column

In [15]:
df1['Gender'].nunique()

2

### 9. Display count of Unique Values in Gender Column

In [16]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

### 10. Find total number fo students having marks between 90 and 100(inclusive) using between method

In [17]:
df1['Marks']

0    98
1    89
2    99
3    97
4    90
5    93
6    89
Name: Marks, dtype: int64

In [18]:
df1['Marks']>=90

0     True
1    False
2     True
3     True
4     True
5     True
6    False
Name: Marks, dtype: bool

In [19]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
3   Vedant     97    Male
4   Parshv     90    Male
5   Miktal     93  Female

In [20]:
(df1['Marks']>=90)  & (df1['Marks']<=100)

0     True
1    False
2     True
3     True
4     True
5     True
6    False
Name: Marks, dtype: bool

In [21]:
df1[(df1['Marks']>=90)  & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
3   Vedant     97    Male
4   Parshv     90    Male
5   Miktal     93  Female

In [22]:
len(df1[(df1['Marks']>=90)  & (df1['Marks']<=100)])

5

In [23]:
# Another method using between method

df1['Marks'].between(90,100)

0     True
1    False
2     True
3     True
4     True
5     True
6    False
Name: Marks, dtype: bool

In [24]:
sum(df1['Marks'].between(90,100))

5

### 11. Find average Marks

In [25]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1  Aadhaya     89  Female
2   Krisha     99  Female
3   Vedant     97    Male
4   Parshv     90    Male
5   Miktal     93  Female
6  Archana     89  Female

In [26]:
df1['Marks'].mean() # avearage marks

93.57142857142857

In [27]:
df1['Marks'].min() # minimum marks

89

In [28]:
df1['Marks'].max() # maximum marks

99

### 12. Apply method

In [29]:
# using our own defined function

def marks(x):
    return x/2

In [30]:
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    48.5
4    45.0
5    46.5
6    44.5
Name: Marks, dtype: float64

In [31]:
df1['Half Marks']=df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  Half Marks
0  Priyang     98    Male        49.0
1  Aadhaya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     97    Male        48.5
4   Parshv     90    Male        45.0
5   Miktal     93  Female        46.5
6  Archana     89  Female        44.5

In [32]:
# applying the lambda function

df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    48.5
4    45.0
5    46.5
6    44.5
Name: Marks, dtype: float64

In [33]:
df1['Name'].apply(len)

0    7
1    7
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

### 13. Map function

In [34]:
df1

      Name  Marks  Gender  Half Marks
0  Priyang     98    Male        49.0
1  Aadhaya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     97    Male        48.5
4   Parshv     90    Male        45.0
5   Miktal     93  Female        46.5
6  Archana     89  Female        44.5

In [35]:
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [36]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})
df1

      Name  Marks  Gender  Half Marks  Male_Female
0  Priyang     98    Male        49.0            1
1  Aadhaya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     97    Male        48.5            1
4   Parshv     90    Male        45.0            1
5   Miktal     93  Female        46.5            0
6  Archana     89  Female        44.5            0

### 14. Drop Column

In [37]:
#drops 1 column 'Male_Female'

df1.drop('Male_Female',axis=1)

      Name  Marks  Gender  Half Marks
0  Priyang     98    Male        49.0
1  Aadhaya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     97    Male        48.5
4   Parshv     90    Male        45.0
5   Miktal     93  Female        46.5
6  Archana     89  Female        44.5

In [38]:
#drops 2 columns 'Male_Female' & 'Half Marks'

df1.drop(['Male_Female','Half Marks'],axis=1,inplace=True)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1  Aadhaya     89  Female
2   Krisha     99  Female
3   Vedant     97    Male
4   Parshv     90    Male
5   Miktal     93  Female
6  Archana     89  Female

In [75]:
df1.drop(['Male_Female','Half Marks'],axis=1,inplace=True)
df1

KeyError: "['Male_Female', 'Half Marks'] not found in axis"

### 15. Print name of columns

In [39]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [40]:
df1.index

RangeIndex(start=0, stop=7, step=1)

### 16.Sort the Dataframe as per the Marks column

In [41]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1  Aadhaya     89  Female
2   Krisha     99  Female
3   Vedant     97    Male
4   Parshv     90    Male
5   Miktal     93  Female
6  Archana     89  Female

In [42]:
# sorting in ascending order

df1.sort_values(by='Marks')

      Name  Marks  Gender
1  Aadhaya     89  Female
6  Archana     89  Female
4   Parshv     90    Male
5   Miktal     93  Female
3   Vedant     97    Male
0  Priyang     98    Male
2   Krisha     99  Female

In [43]:
#sorting in descending order

df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
0  Priyang     98    Male
3   Vedant     97    Male
5   Miktal     93  Female
4   Parshv     90    Male
1  Aadhaya     89  Female
6  Archana     89  Female

In [44]:
# sorting using two columns

df1.sort_values(by=['Marks','Gender'],ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
0  Priyang     98    Male
3   Vedant     97    Male
5   Miktal     93  Female
4   Parshv     90    Male
1  Aadhaya     89  Female
6  Archana     89  Female

### 17. Display Name & Marks of the Female Students

In [45]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1  Aadhaya     89  Female
2   Krisha     99  Female
3   Vedant     97    Male
4   Parshv     90    Male
5   Miktal     93  Female
6  Archana     89  Female

In [46]:
df1['Gender']

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [47]:
df1[df1['Gender']=='Female']

      Name  Marks  Gender
1  Aadhaya     89  Female
2   Krisha     99  Female
5   Miktal     93  Female
6  Archana     89  Female

In [48]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1  Aadhaya     89
2   Krisha     99
5   Miktal     93
6  Archana     89

In [49]:
df1[df1['Gender'].isin(['Female'])]

      Name  Marks  Gender
1  Aadhaya     89  Female
2   Krisha     99  Female
5   Miktal     93  Female
6  Archana     89  Female

In [50]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1  Aadhaya     89
2   Krisha     99
5   Miktal     93
6  Archana     89